In [1]:
import pandas as pd
import numpy  as np

In [2]:
df_1 = pd.read_excel('Air Quality Parameters - MPCB (2006-08).xlsx',parse_dates=['Date'],index_col='Date')
df_1.drop(['Sr.No.','Unnamed: 9','Unnamed: 10','Unnamed: 11','Unnamed: 12'],axis=1,inplace=True)
df_1.head()

           SO2 µg/m3 Nox µg/m3  RSPM µg/m3  SPM  CO2 µg/m3   AQI Location
Date
2007-06-19         6        46        49.0  NaN        NaN  58.0  MPCB-KR
2007-06-20         6        43        29.0  NaN        NaN  54.0  MPCB-KR
2007-06-21         5        43        26.0  NaN        NaN  54.0  MPCB-KR
2007-06-23         7        46        79.0  NaN        NaN  79.0  MPCB-KR
2007-06-24         5        45        19.0  NaN        NaN  56.0  MPCB-KR

In [4]:
df_2 = pd.read_excel('Air Quality Parameters - MPCB (2009-11).xlsx',parse_dates=['Date'],index_col='Date')
df_2.drop(['Sr.No.'],axis=1,inplace=True)
df_2.head()

           SO2 µg/m3 Nox µg/m3  RSPM µg/m3  SPM  CO2 µg/m3  AQI Location
Date
2009-01-01        15        53       179.0  NaN        NaN  153  MPCB-KR
2009-02-01        15        48       156.0  NaN        NaN  137  MPCB-KR
2009-03-01        13        51       164.0  NaN        NaN  143  MPCB-KR
2009-04-01         8        37       135.0  NaN        NaN  123  MPCB-KR
2009-07-01        13        36       140.0  NaN        NaN  127  MPCB-KR

In [58]:
df_3 = pd.read_excel('Air Quality Parameters - MPCB (2012-14).xlsx',parse_dates=['Date'],index_col='Date',sheet_name='2012-14 CSV',na_values=['BDL - NA'])
df_3.drop(['Sr.No.'],axis=1,inplace=True)
df_3.head()

,SO2 µg/m3,Nox µg/m3,RSPM µg/m3,SPM,CO2 µg/m3,AQI,Location
Date,,,,,,,
2012-01-01,10.0,NaN,150,NaN,NaN,133.0,Karve Road
2012-02-01,10.0,NaN,172,NaN,NaN,148.0,Karve Road
2012-03-01,9.0,NaN,143,NaN,NaN,129.0,Karve Road
2012-04-01,10.0,NaN,117,NaN,NaN,111.0,Karve Road
2012-05-01,11.0,NaN,148,NaN,NaN,132.0,Karve Road

In [59]:
df_4 = pd.read_excel('Air Quality Parameters - MPCB (2015-17).xlsx',parse_dates=['Date'],index_col='Date',na_values=['BDL - NA'])
df_4.drop(['Sr.No.','Unnamed: 9','Unnamed: 10'],axis=1,inplace=True)
df_4.head()

            SO2 µg/m3 Nox µg/m3  RSPM µg/m3  SPM  CO2 µg/m3  AQI    Location
Date
2015-01-01         19         9         198  NaN        NaN  165  Karve Road
2015-02-01         19         9         174  NaN        NaN  149  Karve Road
2015-03-01         19         9         151  NaN        NaN  134  Karve Road
2015-04-01         20         9         152  NaN        NaN  135  Karve Road
2015-05-01         20         9         212  NaN        NaN  175  Karve Road

In [47]:
df_5 = pd.read_excel('Air Quality Parameters - MPCB (2018-19 March).xlsx',parse_dates=['Date'],index_col='Date')
df_5.drop(['Sr No'],axis=1,inplace=True)
df_5.head()

,SO2 µg/m3,Nox µg/m3,RSPM µg/m3,SPM,CO2 µg/m3,AQI,Location
Date,,,,,,,
2018-02-01,49,87,263,376.0,NaN,213.0,MPCB-BSRI
2018-05-01,38,81,209,467.0,NaN,173.0,MPCB-BSRI
2018-09-01,34,77,201,305.0,NaN,167.0,MPCB-BSRI
2018-12-01,42,81,165,255.0,NaN,143.0,MPCB-BSRI
2018-01-16,38,79,196,297.0,NaN,164.0,MPCB-BSRI

In [48]:
di ={'MPCB-BSRI':'Bhosari','MPCB-KR':'Karve Road','MPCB-NS':'Nal Stop','MPCB-SWGT':'Swargate','MPCB-PMPR':'Pimpri'}
d2={'Pimpri Chinchwad':'Pimpri'}

In [49]:
df_1['Location']=df_1['Location'].map(di)
df_2['Location']=df_2['Location'].map(di)
#df_3['Location']=df_3['Location'].map(d2)
#df_4['Location']=df_4['Location'].map(di)
df_5['Location']=df_5['Location'].map(di)

In [50]:
df_3['Location']=df_3["Location"].replace("Pimpri Chinchwad",'Pimpri')

In [11]:
df_1.head()

           SO2 µg/m3 Nox µg/m3  RSPM µg/m3  SPM  CO2 µg/m3   AQI    Location
Date
2007-06-19         6        46        49.0  NaN        NaN  58.0  Karve Road
2007-06-20         6        43        29.0  NaN        NaN  54.0  Karve Road
2007-06-21         5        43        26.0  NaN        NaN  54.0  Karve Road
2007-06-23         7        46        79.0  NaN        NaN  79.0  Karve Road
2007-06-24         5        45        19.0  NaN        NaN  56.0  Karve Road

In [12]:
df_2.head()

           SO2 µg/m3 Nox µg/m3  RSPM µg/m3  SPM  CO2 µg/m3  AQI    Location
Date
2009-01-01        15        53       179.0  NaN        NaN  153  Karve Road
2009-02-01        15        48       156.0  NaN        NaN  137  Karve Road
2009-03-01        13        51       164.0  NaN        NaN  143  Karve Road
2009-04-01         8        37       135.0  NaN        NaN  123  Karve Road
2009-07-01        13        36       140.0  NaN        NaN  127  Karve Road

In [13]:
df_3.head()

           SO2 µg/m3 Nox µg/m3  RSPM µg/m3  SPM  CO2 µg/m3    AQI    Location
Date
2012-01-01        10  BDL - NA         150  NaN        NaN  133.0  Karve Road
2012-02-01        10  BDL - NA         172  NaN        NaN  148.0  Karve Road
2012-03-01         9  BDL - NA         143  NaN        NaN  129.0  Karve Road
2012-04-01        10  BDL - NA         117  NaN        NaN  111.0  Karve Road
2012-05-01        11  BDL - NA         148  NaN        NaN  132.0  Karve Road

In [14]:
df_4.head()

            SO2 µg/m3 Nox µg/m3  RSPM µg/m3  SPM  CO2 µg/m3  AQI    Location
Date
2015-01-01         19         9         198  NaN        NaN  165  Karve Road
2015-02-01         19         9         174  NaN        NaN  149  Karve Road
2015-03-01         19         9         151  NaN        NaN  134  Karve Road
2015-04-01         20         9         152  NaN        NaN  135  Karve Road
2015-05-01         20         9         212  NaN        NaN  175  Karve Road

In [15]:
df_5.head()

            SO2 µg/m3  Nox µg/m3  RSPM µg/m3    SPM  CO2 µg/m3    AQI Location
Date
2018-02-01         49         87         263  376.0        NaN  213.0  Bhosari
2018-05-01         38         81         209  467.0        NaN  173.0  Bhosari
2018-09-01         34         77         201  305.0        NaN  167.0  Bhosari
2018-12-01         42         81         165  255.0        NaN  143.0  Bhosari
2018-01-16         38         79         196  297.0        NaN  164.0  Bhosari

In [18]:
df_1.dtypes,df_2.dtypes,df_3.dtypes

(SO2 µg/m3      object
 Nox µg/m3      object
 RSPM µg/m3    float64
 SPM           float64
 CO2 µg/m3     float64
 AQI           float64
 Location       object
 dtype: object,
 SO2 µg/m3      object
 Nox µg/m3      object
 RSPM µg/m3    float64
 SPM           float64
 CO2 µg/m3     float64
 AQI             int64
 Location       object
 dtype: object,
 SO2 µg/m3      object
 Nox µg/m3      object
 RSPM µg/m3      int64
 SPM           float64
 CO2 µg/m3     float64
 AQI           float64
 Location       object
 dtype: object)

In [22]:
df_1.index.duplicated().sum()

958

In [28]:
df_1['Location'].value_counts()

Pimpri        851
Karve Road    439
Nal Stop      302
Swargate      223
Bhosari       205
Name: Location, dtype: int64

In [40]:
df_1.index.drop_duplicates().sort_values()

DatetimeIndex(['2006-01-01', '2006-01-02', '2006-01-03', '2006-01-05',
               '2006-01-06', '2006-01-08', '2006-01-09', '2006-01-11',
               '2006-01-12', '2006-01-13',
               ...
               '2008-12-22', '2008-12-23', '2008-12-24', '2008-12-25',
               '2008-12-26', '2008-12-27', '2008-12-28', '2008-12-29',
               '2008-12-30', '2008-12-31'],
              dtype='datetime64[ns]', name='Date', length=1062, freq=None)

In [29]:
df_2['Location'].value_counts()

Karve Road    972
Nal Stop      310
Swargate      308
Bhosari       306
Name: Location, dtype: int64

In [41]:
df_2.index.drop_duplicates().sort_values()

DatetimeIndex(['2009-01-01', '2009-01-02', '2009-01-04', '2009-01-05',
               '2009-01-06', '2009-01-07', '2009-01-08', '2009-01-09',
               '2009-01-10', '2009-01-11',
               ...
               '2011-12-22', '2011-12-23', '2011-12-24', '2011-12-25',
               '2011-12-26', '2011-12-27', '2011-12-28', '2011-12-29',
               '2011-12-30', '2011-12-31'],
              dtype='datetime64[ns]', name='Date', length=1075, freq=None)

In [30]:
df_3['Location'].value_counts()

Karve Road    1063
Pimpri         854
Swargate       312
Bhosari        305
Nal Stop       300
Name: Location, dtype: int64

In [42]:
df_3.index.drop_duplicates().sort_values()

DatetimeIndex(['2012-01-01', '2012-01-02', '2012-01-03', '2012-01-04',
               '2012-01-05', '2012-01-06', '2012-01-07', '2012-01-08',
               '2012-01-09', '2012-01-10',
               ...
               '2014-12-22', '2014-12-23', '2014-12-24', '2014-12-25',
               '2014-12-26', '2014-12-27', '2014-12-28', '2014-12-29',
               '2014-12-30', '2014-12-31'],
              dtype='datetime64[ns]', name='Date', length=1094, freq=None)

In [31]:
df_4['Location'].value_counts()

Karve Road    1006
Bhosari        300
Nal Stop       275
Swargate       275
Pimpri         254
Name: Location, dtype: int64

In [43]:
df_4.index.drop_duplicates().sort_values()

DatetimeIndex(['2015-01-01', '2015-01-02', '2015-01-03', '2015-01-04',
               '2015-01-05', '2015-01-06', '2015-01-07', '2015-01-08',
               '2015-01-09', '2015-01-10',
               ...
               '2017-12-20', '2017-12-21', '2017-12-22', '2017-12-23',
               '2017-12-24', '2017-12-25', '2017-12-26', '2017-12-27',
               '2017-12-29', '2017-12-30'],
              dtype='datetime64[ns]', name='Date', length=1081, freq=None)

In [32]:
df_5['Location'].value_counts()

Karve Road    414
Pimpri        311
Bhosari       111
Nal Stop       95
Swargate       73
Name: Location, dtype: int64

In [44]:
df_5.index.drop_duplicates().sort_values()

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08',
               '2018-01-09', '2018-01-10',
               ...
               '2019-09-03', '2019-10-01', '2019-10-02', '2019-10-03',
               '2019-11-01', '2019-11-02', '2019-11-03', '2019-12-01',
               '2019-12-02', '2019-12-03'],
              dtype='datetime64[ns]', name='Date', length=442, freq=None)

In [51]:
df_5.index.sort_values()

DatetimeIndex(['2018-01-01', '2018-01-01', '2018-01-01', '2018-01-02',
               '2018-01-02', '2018-01-03', '2018-01-03', '2018-01-03',
               '2018-01-03', '2018-01-04',
               ...
               '2019-11-02', '2019-11-03', '2019-11-03', '2019-12-01',
               '2019-12-01', '2019-12-02', '2019-12-02', '2019-12-02',
               '2019-12-03', '2019-12-03'],
              dtype='datetime64[ns]', name='Date', length=1004, freq=None)

In [97]:
df_final = pd.concat([df_3,df_4])

In [98]:
df_final.shape

(4944, 7)

In [99]:
df_final.head()

            SO2 µg/m3 Nox µg/m3  RSPM µg/m3  SPM  CO2 µg/m3    AQI    Location
Date
2012-01-01       10.0       NaN         150  NaN        NaN  133.0  Karve Road
2012-02-01       10.0       NaN         172  NaN        NaN  148.0  Karve Road
2012-03-01        9.0       NaN         143  NaN        NaN  129.0  Karve Road
2012-04-01       10.0       NaN         117  NaN        NaN  111.0  Karve Road
2012-05-01       11.0       NaN         148  NaN        NaN  132.0  Karve Road

In [100]:
df_final.dtypes

SO2 µg/m3     float64
Nox µg/m3      object
RSPM µg/m3      int64
SPM           float64
CO2 µg/m3     float64
AQI           float64
Location       object
dtype: object

In [101]:
df_final.isna().sum(axis=0)/ df_final.shape[0] *100

SO2 µg/m3       0.262945
Nox µg/m3       1.557443
RSPM µg/m3      0.000000
SPM            64.259709
CO2 µg/m3     100.000000
AQI             0.930421
Location        0.000000
dtype: float64

In [102]:
df_final['Nox µg/m3'].unique()

array([nan, 135.0, 91.0, 98.0, 94.0, 107.0, 105.0, 123.0, 90.0, 137.0,
       80.0, 111.0, 79.0, 71.0, 63.0, 67.0, 78.0, 74.0, 70.0, 72.0, 95.0,
       85.0, 86.0, 73.0, 57.0, 84.0, 75.0, 58.0, 77.0, 65.0, 69.0, 61.0,
       82.0, 76.0, 66.0, 39.0, 68.0, 60.0, 53.0, 56.0, 62.0, 48.0, 55.0,
       54.0, 50.0, 49.0, 51.0, 44.0, 46.0, 43.0, 36.0, 40.0, 41.0, 37.0,
       42.0, 47.0, 52.0, 45.0, 38.0, 29.0, 25.0, 24.0, 23.0, 22.0, 32.0,
       27.0, 30.0, 19.0, 26.0, 28.0, 21.0, 20.0, 33.0, 35.0, 31.0, 34.0,
       64.0, 81.0, 93.0, 92.0, 100.0, 133.0, 129.0, 104.0, 97.0, 124.0,
       88.0, 114.0, 96.0, 89.0, 87.0, 108.0, 118.0, 83.0, 106.0, 110.0,
       103.0, 116.0, 121.0, 102.0, 109.0, 99.0, 101.0, 59.0, 9.0, 16.0,
       15.0, 14.0, 17.0, 112.0, 18.0, 13.0, 128.0, 125.0, 12.0, 188, 193,
       181, 142, 'BDL - 6', 'BDL - 8', 'BDL - 2', 162, 154, 152, 155, 153,
       156, 157, 158, 160, 163, 161, 150, 122, 120, 169, 172, 126, 174,
       143, 127, 138, 10, 130, 119, 113, 254, 270, 117, 131, 115, 167,
       220, 323, 139, 201, 171, 136, 173, 145, 165, 179, 148, 149, 132,
       176, 196, 177, 140], dtype=object)

In [109]:
df_final.loc[ df_final['Nox µg/m3'].str.contains('BDL'), :]

ValueError: Location based indexing can only have [labels (MUST BE IN THE INDEX), slices of labels (BOTH endpoints included! Can be slices of integers if the index is integers), listlike of labels, boolean] types

In [95]:
df_final['Nox µg/m3'] = df_final['Nox µg/m3'].str.replace(r'BDL','')

In [96]:
df_final['Nox µg/m3'].unique()

array([nan, ' - 6', ' - 8', ' - 2'], dtype=object)